// Завдання 2: Конкатенація радків та шаблонний рядок
// Створіть дві змінні, які містять імена двох осіб.
// Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. Виведіть результат в консоль. 
// Потім використайте шаблонний рядок для створення того ж вітання. 
// Виведіть результат в консоль.

// Імена двох осіб
const name1 = 'Оля'
const name2 = 'Аня'

// Конкатенація рядків
const greetingConcat = 'Привіт, ' + name1 + ' і ' + name2 + '! Як справи?'
console.log(greetingConcat)

// Шаблонний рядок
const greetingTemplate = `Привіт, ${name1} і ${name2}! Як справи?`
console.log(greetingTemplate)